In [1]:
import pandas as pd
df1 = pd.DataFrame({
    "ID": [1,2,3,4],
    "Name": ['Alice', 'Bob', 'Charlie', 'David']
})
df1

   ID     Name
0   1    Alice
1   2      Bob
2   3  Charlie
3   4    David

In [2]:
df2 = pd.DataFrame({
    'ID': [3, 4, 5, 6],
    'Age': [25, 30, 35, 40],
})
df2

   ID  Age
0   3   25
1   4   30
2   5   35
3   6   40

In [4]:
inner_join = pd.merge(df1,df2, on="ID", how="inner")
inner_join

   ID     Name  Age
0   3  Charlie   25
1   4    David   30

In [5]:
left_join = pd.merge(df1,df2, on="ID", how="left")
left_join

   ID     Name   Age
0   1    Alice   NaN
1   2      Bob   NaN
2   3  Charlie  25.0
3   4    David  30.0

In [6]:
right_join = pd.merge(df1,df2, on="ID", how="right")
right_join

   ID     Name  Age
0   3  Charlie   25
1   4    David   30
2   5      NaN   35
3   6      NaN   40

In [7]:
outer_join = pd.merge(df1,df2, on="ID", how="outer")
outer_join

   ID     Name   Age
0   1    Alice   NaN
1   2      Bob   NaN
2   3  Charlie  25.0
3   4    David  30.0
4   5      NaN  35.0
5   6      NaN  40.0

In [15]:
df1 = pd.DataFrame({'Name': ['Aman', 'Joy', 'Rashmi', 'Saif'],
                    'Age': ['34', '31', '22', '33'],
                    'Gender': ['M', 'M', 'F', 'M']}
                  )
df1

     Name Age Gender
0    Aman  34      M
1     Joy  31      M
2  Rashmi  22      F
3    Saif  33      M

In [16]:
df2 = pd.DataFrame({'Name': ['Akhil', 'Asha', 'Preeti'],
                    'Age': ['31', '22', '23'],
                    'Gender': ['M', 'F', 'F']}
                  )
df2

     Name Age Gender
0   Akhil  31      M
1    Asha  22      F
2  Preeti  23      F

In [17]:
df3 = pd.concat([df1,df2], axis=0) # concat on rows
df3

     Name Age Gender
0    Aman  34      M
1     Joy  31      M
2  Rashmi  22      F
3    Saif  33      M
0   Akhil  31      M
1    Asha  22      F
2  Preeti  23      F

In [18]:
df3.reset_index()

   index    Name Age Gender
0      0    Aman  34      M
1      1     Joy  31      M
2      2  Rashmi  22      F
3      3    Saif  33      M
4      0   Akhil  31      M
5      1    Asha  22      F
6      2  Preeti  23      F

In [11]:
df1 = pd.DataFrame({'Name': ['Aman', 'Joy', 'Rashmi', 'Saif'],
                    'Age': ['34', '31', '22', '33'],
                    'Gender': ['M', 'M', 'F', 'M']}
                  )
df1

     Name Age Gender
0    Aman  34      M
1     Joy  31      M
2  Rashmi  22      F
3    Saif  33      M

In [12]:
df2 = pd.DataFrame({'School': ['RK Public', 'JSP', 'Carmel Convent', 'St. Paul'],
                    'Graduation Marks': ['84', '89', '76', '91']}
                  )
df2

           School Graduation Marks
0       RK Public               84
1             JSP               89
2  Carmel Convent               76
3        St. Paul               91

In [13]:
df3 = pd.concat([df1,df2], axis=1) # concat on columns
df3

     Name Age Gender          School Graduation Marks
0    Aman  34      M       RK Public               84
1     Joy  31      M             JSP               89
2  Rashmi  22      F  Carmel Convent               76
3    Saif  33      M        St. Paul               91